* Build Development Environment
** Install Common Used Libs
*** boost
- Ubuntu
sudo apt-get install libboost-all-dev
* DataType
** DataType Convertion
*** string to other datatypes
- atof : convert string to double
- atoi : convert string to integer
- atoll : convert string to long integger
- strtof : convert string to double
- strtof : convert string to float
- strtoll : convert sting to long integer
- strtoul : convert string to unsigned long integer
- strtoull : convert string to unsigned long long integer
*** convert to string

#+BEGIN_SRC C++ :exports both
#include <string>
#include <sstream>
#include <iostream>
using namespace std;
int main(int argc, char *argv[])
{
  int int_val=100;
  stringstream strm;
  strm<<int_val;
  string s=strm.str();
  cout<<s<<endl;
  return 0;
}
#+END_SRC

#+RESULTS:
: 100

* boost
** Lexical Cast
 Use "boost" lib to Convert DataType
#+BEGIN_SRC C++ :exports_both
  #include <string>
  #include <iostream>
  #include "boost/lexical_cast.hpp"
  using boost::lexical_cast;
  using boost::bad_lexical_cast;
  using namespace std;
  int main(int argc, char *argv[])
  {
    int s=23;
    string str=lexical_cast<string>(s);
    cout<<"int to str: "<<str<<endl;

    str="Message: "+lexical_cast<string>('A')+"="+lexical_cast<string>(34.5);
    cout<<"char and float to str: "<<str<<endl;

    array<char,64> msg=lexical_cast<array<char,64>>(23);
    for (int i=0; i <2 ; i++) {
      cout<<"int to char array, msg:"<<msg[i]<<endl;
    }


    s=lexical_cast<int>("3456");
    cout<<"int to string:"<<s<<endl;

    try {
      s=lexical_cast<int>("56.78");  // bad_lexical_cast
    } catch (bad_lexical_cast &e) {
      cout<<"Exception caught: "<<e.what()<<endl;
    }
    try{
    s=lexical_cast<int>("3456yu");//bad_lexical_cast
    }catch(bad_lexical_cast &e){
      cout<<"Exception caught: "<<e.what()<<endl;
    }
    s=lexical_cast<int>("3456yu",4);
    cout<<s<<endl;
    return 0;
  }

#+END_SRC

#+RESULTS:
| int       | to      | str:        | 23      |       |          |        |       |       |     |    |             |    |        |
| char      | and     | float       | to      | str:  | Message: | A=34.5 |       |       |     |    |             |    |        |
| int       | to      | char        | array,  | msg:2 |          |        |       |       |     |    |             |    |        |
| int       | to      | char        | array,  | msg:3 |          |        |       |       |     |    |             |    |        |
| int       | to      | string:3456 |         |       |          |        |       |       |     |    |             |    |        |
| Exception | caught: | bad         | lexical | cast: | source   | type   | value | could | not | be | interpreted | as | target |
| Exception | caught: | bad         | lexical | cast: | source   | type   | value | could | not | be | interpreted | as | target |
| 3456      |         |             |         |       |          |        |       |       |     |    |             |    |        |

** variant

#+BEGIN_SRC C++ :exports_both
#include <vector>
#include <iostream>
#include "boost/variant.hpp"
using namespace std;
int main(int argc, char *argv[])
{
  //union
  union {int i; float f;} u;
  u.i=34;
  u.f=2.3;

  boost::variant<int,string> u1,u2;
  u1=2;
  u2="hello";
  cout<<u1<<" "<<u2<<endl;

  //u1=u1*2 error
  u1=boost::get<int>(u1)*2;

  try{
    string st=boost::get<string>(u1);  // throw exception of bad_get
  }catch(boost::bad_get &e){
    cout<<"Exception caught: "<<e.what()<<endl;
  }
  u1="good";  // u1 become a sting
  u1=32;      // u1 become a int again

  boost::variant<int,string> u3;
  cout<<u3<<endl;

  void Double(boost::variant<int,string> v);

  // using visitor
  class DoubleVisitor: public boost::static_visitor<>{
   public:
    void operator() (int& i) const {
      i+=i;
    }
    void operator() (string& str) const{
      str+=str;
    }
  };

  u1=2;
  boost::apply_visitor(DoubleVisitor(),u1);  // u1 become 4
  u2="hello";
  boost::apply_visitor(DoubleVisitor(),u2);  // u2 become "hellohello"

  std::vector<boost::variant<int,string>> vec;
  vec.push_back("good");
  vec.push_back(23);
  vec.push_back("bad");

  DoubleVisitor f;
  for(auto x: vec){
    boost::apply_visitor(f,x);
    cout<<x<<endl;
  }

  return 0;
}
#+END_SRC

#+RESULTS:
|         2 | hello   |                 |        |       |     |       |            |
| Exception | caught: | boost::bad_get: | failed | value | get | using | boost::get |
|         0 |         |                 |        |       |     |       |            |
|  goodgood |         |                 |        |       |     |       |            |
|        46 |         |                 |        |       |     |       |            |
|    badbad |         |                 |        |       |     |       |            |

** Any
#+BEGIN_SRC C++ :exports_both
#include <vector>
#include <iostream>
#include "boost/any.hpp"
using namespace std;
int main(int argc, char *argv[])
{
  boost::any x,y,z;
  x=string("hello");
  x=2.3;
  y='z';
  z=vector<int>();

  cout<<boost::any_cast<char>(y)<<endl;  // return a copy of y's data: 'z'
  cout<<boost::any_cast<double>(x)<<endl; // return a copy of x's data: 2.3
  try {
    cout<<boost::any_cast<int>(x)<<endl;  // throws bad_cast_any
  } catch (boost::bad_any_cast& e) {
    cout<<"Exception: "<<e.what()<<endl;
  }
  try {
    cout<<boost::any_cast<float>(x)<<endl;  // throws bad_any_cast
  } catch (boost::bad_any_cast& e) {
    cout<<"Exception: "<<e.what()<<endl;
  }

  if(x.empty())
    cout<<"x is empty"<<endl;

  if(x.type()==typeid(char))
    cout<<"x is char"<<endl;

  /*This is the wrong use example
  boost::any_cast<vector<int>>(z).push_back(23);
  int i=boost::any_cast<vector<int>>(z).back();  // crash, becase boost::any_cast<vector<int>>(z) return a copy of variable z
  */
  int i;
  boost::any p=&i;
  int* pInt=boost::any_cast<int*>(p);  // returns a pointer

  vector<boost::any> m;
  m.push_back(2);
  m.push_back('a');
  m.push_back(p);
  m.push_back(boost::any());

  struct Property{
    string name;
    boost::any value;
  };

  vector<Property> properties;

  return 0;
}

#+END_SRC

#+RESULTS:
| z          |                      |        |            |       |                 |
| 2.3        |                      |        |            |       |                 |
| Exception: | boost::bad_any_cast: | failed | conversion | using | boost::any_cast |
| Exception: | boost::bad_any_cast: | failed | conversion | using | boost::any_cast |
- This is a common wrong use example
#+BEGIN_SRC C++ :exports_both
  boost::any z;
  z=vector<int>();
  boost::any_cast<vector<int>>(z).push_back(23);
  int i=boost::any_cast<vector<int>>(z).back();  // crash, becase boost::any_cast<vector<int>>(z) return a copy of variable z
#+END_SRC

** optional
#+BEGIN_SRC C++ :exports_both
#include "boost/optional.hpp"
#include "boost/variant.hpp"
#include <iostream>
#include <vector>
#include <deque>
using namespace std;

deque<char> queue;

boost::optional<char>  get_async_data(){
  if(!queue.empty())
    return boost::optional<char>(queue.back());
  else
    return boost::optional<char>();
}

int main(int argc, char *argv[])
{
  boost::variant<nullptr_t,char> v;
  boost::optional<char> op;  // op is uninitalized, no char is constructed
  op='A';                    // op contains 'A'

  op=get_async_data();
  if(!op)
    cout<<"No data is available"<<endl;
  else
  {
    cout<<"op contains: "<<op.get()<<endl;  // get() will crash if op is uninitialized
    cout<<"op contains: "<<*op<<endl;       // crash if op is uninitialized
  }

  op.reset();  // reset op uninitialized state
  cout<<op.get_value_or('z')<<endl;  // return 'z' if op is empty

  char* p =op.get_ptr();  // return null if op is empty

  //optional can store any kind of data
  struct A{string name; int value;};
  A a;
  cout<<"a's name: "<<a.name<<"a's value: "<<a.value<<endl;

  boost::optional<A> opA0;  // constructor of A is not called
  boost::optional<A> opA(a);  // a is copy constructed into opA
  cout<<opA->name<<" "<<opA->value<<endl;

  //Pointer
  boost::optional<A*> opAP(&a);
  (*opAP)->name="Bob";

  //Reference
  boost::optional<A&> opAR(a);
  opAR->name="Bob";  // this changes a.name

  //Relational Operator
  boost::optional<int> i1(1);
  boost::optional<int> i2(9);
  boost::optional<int> i3;
  if(i1<i2)
    cout<<"i2 is bigger"<<endl;  // if both are initialized, *i1<*i2, i3 is uninitialized which is samll than the initialized value

  return 0;
}

#+END_SRC

#+RESULTS:
| No  | data  | is     | available |   |
| z   |       |        |           |   |
| a's | name: | a's    | value:    | 1 |
| 1   |       |        |           |   |
| i2  | is    | bigger |           |   |

* reference
1. [[http://boqian.weebly.com/][boqian's space]]
